<template><h1 id="什么是数据结构" tabindex="-1"><a class="header-anchor" href="#什么是数据结构" aria-hidden="true">#</a> 什么是数据结构</h1>
<p>从广义和狭义两个层面来理解数据结构和算法</p>
<p>数据结构就是一组数据的存储结构。算法就是操作数据的一组方法。</p>
<p>例如在图书馆里，图书管理员为了方便查找，会将书籍分门别类进行“存储”。按照一定规则变好，这就是书籍这种“数据结构”</p>
<p>如何找到这本书呢？有很多方法，你可以一本一本找，也可以先根据书籍类别的变好，是人文，还是科学、计算机，来定位书架，然后再依次查找。笼统地说，这些查找方式都是算法</p>
<p>从狭义上讲，也就是我们面试中常考的那些数据结构和算法，比如队列、栈、堆、二分查找、动态规划。这些都是前人智慧的结晶，我们可以直接拿来用。</p>
<p>数据结构与算法是相辅相成的。数据结构是为算法服务的，算法要作用在特定的数据结构之上。因此，我们无法孤立数据结构来讲算法，也无法孤立算法来讲数据结构</p>
<p>比如，因为数据具有随机访问的特点，常用的二分查找算法需要用数组来存储数据。但如果我们选择链表这种数据结构，二分查找算法就无法工作了，因为链表并不支持随机访问</p>
<h3 id="学习的重点在什么地方" tabindex="-1"><a class="header-anchor" href="#学习的重点在什么地方" aria-hidden="true">#</a> 学习的重点在什么地方</h3>
<p>想要学习数据结构与算法，<strong>首先要掌握一个数据结构与算法中最重要的概念——复杂度分析</strong></p>
<p><img src="@source/.vuepress/public/images/DataStructure/数据结构思维导图.jpg" alt="数据结构思维导图"></p>
<p>我们这里只讲10个最常用的数据结构：<strong>数组、链表、栈、队列、散列表、二叉树、堆、跳表、图、Trie树</strong>；10个算法：<strong>递归、排序、二分查找、搜索、哈希算法、贪心算法、分治算法、回溯算法、动态规划、字符串匹配算法</strong></p>
</template>
