
const Quotes = [
    '酒肉穿肠过 ，佛祖心中留， 世人若学我，如同进魔道。',
    '往者不可谏，来者犹可追',
    '像我们这样的大族人家，若从外头杀来，一时是杀不死的，必须先从家里自杀自灭起来，才能一败涂地',
    '母弱出商贾，父强做侍郎，族望留原籍，家贫走他乡',
    '找一个真正好的人，而不是喜欢你的人，才能长久。因为喜欢会变，但一个人的底色是长久不变的（多看看他怎么和家人、朋友相处的），就能知晓',
    '善战者无赫赫之功，善医者无煌煌之名',
    '不平则鸣，有骨气；不平则怨，没出息',
    '骏马常驮痴汉走，巧妻常伴拙夫眠',
    '天子之怒，伏尸百万，流血千里。布衣之怒，亦免冠徒跣，以头抢地耳',
    '年少不懂曲中意，读懂已是曲中人',
    '生活上要知足，学习上要不知足，工作上要知不足',
    '人与人的区别不是”受过教育“和”没受过教育“，而是”喜欢阅读“和”不喜欢阅读“ ',
    '如果你有强烈的好奇心，祝贺你，你的智力胃口很好！',
    '即使没有上帝，也要创造一个',
    '你应该更严格地对待身体，使它不至于不顺从你的思想',
    '得一个后果不算严重的慢性病，是确保健康长寿的最好方式',
    '万事无他，唯手熟尔',
    '山河已无恙，吾辈当自强',
    '权力的实质不是你能做你想做的事，而是你可以让别人做他不想做的事。',
    '我生来就是高山而非溪流，我欲于群峰之巅俯视平庸的沟壑。我生来就是人杰而非草芥，我站在伟人之肩藐视卑微的懦夫。',
    '坚持马克思主义，坚持其活的灵魂——实事求是。',
    '真正的有趣是你觉得世界有趣，而假的有趣是你只觉得自己有趣',
    '人把自己置身于忙碌当中，有一种麻木的踏实，但丧失了真实。什么是真实？你看到什么、听到什么、做什么、和谁在一起，有一种从心灵深处满溢出来的不懊悔，也不羞耻的平和与喜悦。',
    '仗义每多屠狗辈，负心多是读书人',
    '你还很年轻，将来你会遇到很多人，经历很多事，得到很多，也会失去很多，但无论如何，有两样东西，你绝不能丢弃，一个叫良心，一个叫理想。',
    '成功只有一个——按照自己的方式，去度过人生',
    '时代的水流漫过了每一只筏子，浸湿了我们的脚，而大雨迟早要来',
    '当混浊变成一种常态，清白也会是一种罪行',
    '我给自己规定的责任，不管是对还是错，好比一棵结实的大树，任它雨暴风狂，我也会有所依靠。我有过动摇，左晃右晃，因为我毕竟只是一个人……但我并未被刮走。',
    '优于别人，并不高贵，真正的高贵应该是优于过去的自己',
    '比较是万恶之源，而恶会受到到惩罚 ',
    '除了担心，嫉妒也许是不幸福的最大原因之一',
    '费尽周折才得到某样东西的人，比轻轻轻松就得到的人，对这件东西往往更为珍视。',
    '人境遇的改变往往是非线性的。积累和等待的过程很难熬，这是很多人无法改变的原因之一',
    '我们塑造了工具，而后工具也在塑造我们'
]

let randomIndex = Math.floor(Math.random() * Quotes.length);

let randomItem = Quotes[randomIndex];

export default randomItem
