<template><h1 id="webpack导航" tabindex="-1"><a class="header-anchor" href="#webpack导航" aria-hidden="true">#</a> Webpack导航</h1>
<blockquote>
<p>妇人说：“我听话，我不哭的。可我还要给你说的，我不说就要憋死我了！我越是大着胆儿跟你往来，心里越是害怕，害怕这样下去，日子该怎么个过呀？！庄哥，我要嫁你，真的，我要嫁了你！”妇人说着，不等庄之蝶反应，就又说：“我想嫁给你，做长长久久的夫妻，我虽不是有什么本事的人，又没个社会地位，甚至连个西京城里的户口都没有，恐怕也比不了牛月清伺候你伺候得那么周到，但我敢说我会让你活得快乐，永远会让你快乐！因为我看得出来，我也感觉到了，你和一般人不一样，你是作家，你需要不停地寻找什么刺激，来激活你的艺术灵感。而一般人，也包括牛月清在内，她们可以管你吃好穿好，却难以不停地调整自己给你新鲜。你是个认真的人，这我一见到你就这么认为，但你为什么阴郁，即使笑着那阴郁我也看得出来，以至于又为什么能和我走到这一步呢？我猜想这其中有许多原因，但起码暴露了一点，就是你平日的一种性的压抑。
我相信我并不是多坏的女人，成心要勾引你，坏你的家庭，也不是企图享有你的家业和声誉，那这是什么原因呢？或许别人会说你是喜新厌旧的男人，我更是水性杨花的浪荡女人了。不是的，人都有追求美好的天性，作为一个搞创作的人，喜新厌旧是一种创造欲的表现！可这些，自然难被一般女人所理解，因此牛月清也说她下辈子再不给作家当老婆了。在这一点上，我自信我比她们强，我知道、我也会来调整了我来适应你，使你常看常新。适应了你也并不是没有了我，却反倒使我也活得有滋有味。反过来说，就是我为我活得有滋有味了，你也就常看常新不会厌烦。</p>
</blockquote>
<p>万字长文，带你从零学习 Webpack</p>
<p>https://mp.weixin.qq.com/s/2rUjUM6Zfu1I7cjRUDschg</p>
<p>我打算写一篇关于webpack的系列文章，从零到搭配极致的前端脚手架，技术栈是webpack+react。虽然网上有大把大把的资料和教程，但要么不全，要么简单。</p>
<p><RouterLink to="/webpack/webpack%E4%BB%8E%E9%9B%B6%E5%88%B0%E6%80%BB%E7%BB%93.html">webpack从零到总结</RouterLink></p>
<p>第零篇：webpack是什么，为何要用webpack</p>
<p>​	扫盲，模块化的进程（这个可以单独拿出来讲），</p>
<p>​	mode:</p>
<p>​	entry</p>
<p>​	output</p>
<p>​	loader</p>
<p>​	plugins</p>
<p>第一篇 搭建webpack4+react16全家桶+babel7</p>
<p>我们开始讲webpack，从最开始已经讲了webpack是个打包器，现在我们以打造脚手架为目的，开始揭开webpack 的面纱</p>
<p>webpack打包js，那css能打包吗？</p>
<p>第二篇：loader，我的爱人你在哪里</p>
<p>webpack可以打包一切，包括css，img，font字体</p>
<p>sass-loader postcss-loader</p>
<p>第三篇：plugin，我是风，我要掌握一切</p>
<p>Html-webpack-plugin 生成html文件</p>
<p>clean-webpack-plugin 清除dist文件</p>
<p>第四篇： babel，你终于来啦</p>
<p>讲babel是什么</p>
<p>在项目中引入什么</p>
<p>第五篇：</p>
</template>
